{
    "TR": {
        "PAGE_OPTIONS_HOME": "Ana Dizin",
        "PAGE_OPTIONS_HOME_TITLE": "pescanner",
        "PAGE_OPTIONS_HOME_PARAGRAPH": "pescanner, makine öğrenmesi tabanlı bir zararlı dosya tespit aracıdır. Kaggle üzerindeki [veriseti](https://www.kaggle.com/datasets/amauricio/pe-files-malwares/data) kullanılarak eğitilmiştir. 'pefile' kütüphanesi kullanılarak özellik seçimi işlemi yapılmıştır. Çalışma adımları;",
        "PAGE_OPTIONS_HOME_STEPS_1": "1. **Gerekli kütüphaneler yüklenir:** Modeller 'Kaggle' platformu üzerinde eğitilmiştir. Gerekli kütüphaneler yüklenirmiştir. Yardımcı fonksiyonlar tanımlamıştır. Kütüphane konfigürasyonları yapılmıştır.",
        "PAGE_OPTIONS_HOME_STEPS_2": "2. **Veri seti analizi:** Veri setinde boş değer ve tekrarlanan değerler kontrol edilmiştir. Numerik ve kategorik sütunlar tespit edilmiştir.",
        "PAGE_OPTIONS_HOME_STEPS_3": "3. **Görselleştirme**: Keşifçi veri analizi yapılmıştır.",
        "PAGE_OPTIONS_HOME_STEPS_4": "4. **Özellik Ölçeklendirme:** Gereksiz sütunlar düşürülmüştür. Kalan veriler tamamen numerik değerlerden oluşmaktadır. 'RobustScaler' ile standardizasyon yapılmıştır.",
        "PAGE_OPTIONS_HOME_STEPS_5": "5. **Sentetik Üretme:** Veri setindeki düzensizliği gidermek için sentetik veriler üretilmiştir.",
        "PAGE_OPTIONS_HOME_STEPS_6": "6. **Özellik Seçimi:** SelectKBest metodu ile özellik seçimi yapılmıştır.",
        "PAGE_OPTIONS_HOME_STEPS_7": "7. **Hiperparametre Seçimi:** Optuna aracı ile hiperparametreler seçilmiştir.",
        "PAGE_OPTIONS_HOME_STEPS_8": "8. **Kalibrasyonu:** 'Isotonic' ve 'Sigmoid' kalibrasyon yöntemlerinden uygun olan seçilmiştir.",
        "PAGE_OPTIONS_HOME_STEPS_9": "9. **Açıklanabilirlik:** LIME kütüphanesi ile model açıklanmıştır.",

        "PAGE_OPTIONS_HOME_INSTALLATION_TITLE": "## Kurulum",
        "PAGE_OPTIONS_HOME_INSTALLATION_PARAGRAPH": "Gerekli kütüphaneleri kurmak için aşağıdaki komutu çalıştırınız.",
        "PAGE_OPTIONS_HOME_USAGE_TITLE": "## Komutlar",
        "PAGE_OPTIONS_HOME_USAGE_1": "Tek bir dosyayı taramak için '--file' parametresi kullanılır.",
        "PAGE_OPTIONS_HOME_USAGE_2": "Bir dizin içerisindeki dosyaları taramak için '--path' parametresi kullanılır.",
        "PAGE_OPTIONS_HOME_USAGE_3": "Eğer tarama sonucunda dosya zararlı olarak işaretlenmişse otomatik olarak silmek için '--remove' parametresi kullanılır.",
        "PAGE_OPTIONS_HOME_USAGE_4": "Taranan dosyaların sonuçlarını CSV formatında bir dosyada almak için '--report' parametresi kullanılır.",

        "PAGE_OPTIONS_UPLOAD": "Yükle",
        "PAGE_OPTIONS_UPLOAD_TITLE": "Örnek Özellikler",
        "PAGE_OPTIONS_UPLOAD_HEADER": "Dosya adı: abc.exe",

        "PAGE_OPTIONS_MODELS": "Modeller",
        "PAGE_OPTIONS_MODELS_TITLE": "Modeller",
        "PAGE_OPTIONS_MODELS_HEADER": "Eğilen Modeller",
        "PAGE_OPTIONS_MODELS_LEGEND_1": "Eğitim doğruluğu",
        "PAGE_OPTIONS_MODELS_LEGEND_2": "Sınama doğruluğu",
        "PAGE_OPTIONS_MODELS_GRAPH_TITLE": "En iyi modeller",

        "PAGE_OPTIONS_FEATURES": "Özellikler",
        "PAGE_OPTIONS_FEATURES_TITLE": "Özellikler",
        "PAGE_OPTIONS_FEATURES_e_magic": "PE başlığının ilk 2 baytını oluşturur. Dosyanın PE dosyası olup olmadığını belirlemek için kullanılır.",
        "PAGE_OPTIONS_FEATURES_e_cblp": "Dosyanın DOS programı olarak çalıştırıldığında yürütülebilir kodun boyunu belirtir.",
        "PAGE_OPTIONS_FEATURES_e_cp": "PE dosyasındaki yeniden yerleştirme (relocation) girişlerinin sayısını belirtir. Yeniden yerleştirme girişleri, dosyanın bellekteki adresini değiştirmek için kullanılır ve dosya bir farklı bellek adresinde yüklenmek istendiğinde kullanılır.",
        "PAGE_OPTIONS_FEATURES_e_crlc": "PE dosyasında kullanılan fix-up (düzeltme) bloklarının sayısını belirtir. Fix-up blokları, dosyanın yürütülebilir kodunu farklı bir adres alanına taşımak için gereken düzeltmeleri içerir.",
        "PAGE_OPTIONS_FEATURES_e_cparhdr": " PE dosyasının başlık bölümünde (header) bulunan paragrafların sayısını belirtir. Paragraflar, 16 bayt uzunluğundaki bellek bloklarıdır ve bu alan, dosyanın başlık bölümünün boyutunu belirlemek için kullanılır.",
        "PAGE_OPTIONS_FEATURES_e_minalloc": "DOS programının çalıştırıldığında başlaması gereken minimum hafıza bloğunun sayısını belirtir. Yani, dosyanın gerektirdiği en az bellek miktarını ifade eder. Bu değer, dosyanın çalışması için gereken bellek miktarının alt sınırını gösterir ve DOS programının bellek ihtiyacını belirlemek için kullanılır.",
        "PAGE_OPTIONS_FEATURES_e_maxalloc": "DOS programının çalıştırıldığında isteyebileceği maksimum hafıza bloğunun sayısını belirtir. Yani, dosyanın gerektirebileceği en fazla bellek miktarını ifade eder. Bu değer, dosyanın çalışması için gereken bellek miktarının üst sınırını gösterir ve DOS programının bellek ihtiyacını belirlemek için kullanılır. ",
        "PAGE_OPTIONS_FEATURES_e_ss": "DOS programının yürütülebilir kodunun yığın (stack) segmentini belirtir. Yığın segmenti, programın çalışma zamanında kullanılan geçici verilerin ve fonksiyon çağrıları sırasında kullanılan yerel değişkenlerin saklandığı bellek bölgesidir. Bu alan, DOS programının yığın segmentinin bellek adresini belirlemek için kullanılır.",
        "PAGE_OPTIONS_FEATURES_e_sp": "DOS programının yürütülebilir kodunun yığın (stack) segmenti içindeki yığın işaretçisinin (stack pointer) başlangıç adresini belirtir. Yığın işaretçisi, programın çalışma zamanında yığında (stack) yapılan işlemleri takip eder ve geçici verilerin saklandığı bellek bölgesinin konumunu işaret eder.",
        "PAGE_OPTIONS_FEATURES_e_csum": "DOS programının çalıştırıldığında başlangıç adresinden başlayarak DOS programının tüm dosya bölümlerinin 16-bit word (2 byte) toplamının mod 65535 (0xFFFF) değerine eşit olup olmadığını belirtir. Bu, dosyanın bütünlüğünün kontrol edilmesi için kullanılır ve hata tespiti amacıyla dosyanın sağlam olup olmadığını belirlemek için kullanılır.",
        "PAGE_OPTIONS_FEATURES_e_ip": "DOS programının yürütülebilir kodunun başlangıç adresini (instruction pointer) belirtir. Yürütülebilir dosyanın çalıştırılmasıyla birlikte işletim sistemi, bu alanın değerini kullanarak programın yürütülebilir kodunun nereden başlayacağını belirler.",
        "PAGE_OPTIONS_FEATURES_e_cs": "DOS programının yürütülebilir kodunun kod segmentini belirtir. Kod segmenti, programın yürütülebilir kodunu içeren bellek bölgesidir. Programın çalıştırılmasıyla birlikte işletim sistemi, bu alanın değerini kullanarak kod segmentinin bellekteki konumunu belirler.",
        "PAGE_OPTIONS_FEATURES_e_lfarlc": "PE dosyasındaki yeniden yerleştirme (relocation) tablosunun dosyanın başından itibaren uzun dosya adresi olarak ifade edilen ofsetini belirtir. Yeniden yerleştirme tablosu, dosyanın farklı bir bellek adresine yüklenmesi gerektiğinde kullanılan verileri içerir. Bu alan, yeniden yerleştirme tablosunun dosya içindeki konumunu belirlemek için kullanılır.",
        "PAGE_OPTIONS_FEATURES_e_ovno": "DOS programının yürütülebilir kodunun işaret ettiği örtü (overlay) numarasını belirtir. Overlay, bir dosyanın içine gömülü ek veri veya kod parçalarını ifade eder ve bu alan, dosyanın içerdiği örtü numarasını belirlemek için kullanılır. ",
        "PAGE_OPTIONS_FEATURES_e_oemid": "PE dosyasının oluşturulduğu donanım platformunu belirten bir özel ekipman üreticisi (OEM) tanımlayıcısını içerir.",
        "PAGE_OPTIONS_FEATURES_e_lfanew": "Dosyanın yeni yürütülebilir başlık (executable header) bölümünün dosyanın başlangıcından itibaren uzun dosya adresi olarak ifade edilen ofsetini belirtir. Yürütülebilir başlık bölümü, PE dosyasının yapısı hakkında önemli bilgiler içerir ve dosyanın yürütülebilir kodunun ve veri segmentlerinin konumunu belirler.",
        "PAGE_OPTIONS_FEATURES_Machine": "PE (Portable Executable) dosyasının yürütülebilir kodunun hedeflediği işlemci mimarisini belirten bir alan veya özelliktir. Bu alan, dosyanın hangi tür işlemcilerde çalışacağını belirlemek için kullanılır. ",
        "PAGE_OPTIONS_FEATURES_NumberOfSections": "PE dosyasının içinde bulunan bölümlerin (sections) sayısını belirtir. Bölümler, dosyanın farklı bölümlerinde bulunan kod, veri ve kaynak dosyalarını içerir. Bu alan, dosyanın yapısını tanımlamak ve bellekteki her bölümün boyutunu ve konumunu belirlemek için kullanılır.",
        "PAGE_OPTIONS_FEATURES_TimeDateStamp": "Dosyanın derleme veya değişiklik zamanını temsil eden bir zaman damgası (timestamp) değerini içerir. Genellikle bu değer, UTC (Koordinatlı Evrensel Zaman) formatında UNIX zaman damgası olarak ifade edilir.",
        "PAGE_OPTIONS_FEATURES_PointerToSymbolTable": "PE dosyasındaki sembol tablosunun (symbol table) başlangıç adresini belirtir. Sembole tablosu, dosyadaki sembollerin (fonksiyonlar, değişkenler, vb.) listesini ve bu sembollere ilişkin bilgileri içerir.",
        "PAGE_OPTIONS_FEATURES_NumberOfSymbols": "PE dosyasındaki sembol tablosundaki (symbol table) sembollerin (fonksiyonlar, değişkenler, vb.) toplam sayısını belirtir. Sembole tablosu, dosyadaki sembollerin listesini ve bu sembollere ilişkin bilgileri içerir.",
        "PAGE_OPTIONS_FEATURES_SizeOfOptionalHeader": "PE dosyasının isteğe bağlı başlık (optional header) bölümünün boyutunu belirtir. İsteğe bağlı başlık bölümü, dosyanın özelliklerini ve isteğe bağlı verilerini içerir.",
        "PAGE_OPTIONS_FEATURES_Characteristics": "PE dosyasının özelliklerini ve yapılandırmasını belirten bayrakları içerir. Özellikle, bu alan, dosyanın 32 veya 64 bitlik bir dosya olduğunu, bir DLL dosyası olup olmadığını, bir sistem dosyası olup olmadığını ve diğer özelliklerini belirten bayraklar içerir.",
        "PAGE_OPTIONS_FEATURES_Magic": "PE dosyasının türünü belirten bir değer içerir. Örneğin, 16-bit DOS uygulamaları için 'MZ' (0x5A4D) değeri, 32-bit Windows uygulamaları için 'PE\\0\\0' (0x50 0x45 0x00 0x00) değeri gibi farklı değerler alabilir.",
        "PAGE_OPTIONS_FEATURES_MajorLinkerVersion": "Dosyanın linkleyici (linker) programının ana sürüm numarasını belirtir. Linkleyici, kaynak kodu ve diğer kaynak dosyalarını birleştirerek yürütülebilir bir dosya oluşturan yazılımdır. Bu alan, dosyanın hangi sürümdeki bir linkleyici tarafından oluşturulduğunu belirler.",
        "PAGE_OPTIONS_FEATURES_MinorLinkerVersion": "Dosyanın linkleyici (linker) programının yan sürüm numarasını belirtir.",
        "PAGE_OPTIONS_FEATURES_SizeOfCode": "Dosyanın yürütülebilir kod bölümünün (code section) boyutunu bayt cinsinden belirtir. Yürütülebilir kod bölümü, programın asıl işlevlerini içeren ve bellekte yürütülecek olan kod segmentidir.",
        "PAGE_OPTIONS_FEATURES_SizeOfInitializedData": "Dosyanın başlangıçta tanımlanmış ve başlangıç değerleriyle doldurulmuş veri bölümlerinin boyutunu belirtir. Bu veri bölümleri, programın çalışması için gerekli olan sabit verileri içerir.",
        "PAGE_OPTIONS_FEATURES_SizeOfUninitializedData": "Dosyanın başlangıçta tanımlanmamış ancak bellekte ayrılmış olan veri bölümlerinin boyutunu belirtir.",
        "PAGE_OPTIONS_FEATURES_AddressOfEntryPoint": "Dosyanın başlatma (entry) noktasının bellek adresini belirtir. Başlatma noktası, programın yürütülebilir kodunun başladığı bellek adresidir.",
        "PAGE_OPTIONS_FEATURES_BaseOfCode": "Dosyanın yürütülebilir kod bölümünün (code section) başlangıç bellek adresini belirtir. Yürütülebilir kod bölümü, programın asıl işlevlerini içeren ve bellekte yürütülecek olan kod segmentidir.",
        "PAGE_OPTIONS_FEATURES_ImageBase": "Dosyanın bellekteki yüklenme başlangıç adresini belirtir. Yani, dosyanın bellekte yüklenme işlemi sırasında hangi adres aralığında yer alacağını belirler.",
        "PAGE_OPTIONS_FEATURES_SectionAlignment": "Dosyanın bölümlerinin bellekte hizalanmasını belirler. Yani, her bölümün bellekteki başlangıç adresinin bölüm hizalaması ile uyumlu olmasını sağlar.",
        "PAGE_OPTIONS_FEATURES_FileAlignment": "Dosyanın diskte hizalanma gereksinimini belirler. Dosyanın diskteki başlangıç adresinin bu hizalamaya uygun olmasını sağlar, böylece dosyanın diskteki boyutu ve hafıza kullanımı optimize edilir.",
        "PAGE_OPTIONS_FEATURES_MajorOperatingSystemVersion": "Dosyanın derlendiği işletim sisteminin ana sürüm numarasını belirtir.",
        "PAGE_OPTIONS_FEATURES_MinorOperatingSystemVersion": "Dosyanın derlendiği işletim sisteminin yan sürüm numarasını belirtir.",
        "PAGE_OPTIONS_FEATURES_MajorImageVersion": "Dosyanın ana imaj (image) sürüm numarasını belirtir. Bu sürüm numarası, dosyanın kullanıcıya sunulan veya hizmete sunulan sürümünü tanımlar. ",
        "PAGE_OPTIONS_FEATURES_MinorImageVersion": "Dosyanın yan imaj (image) sürüm numarasını belirtir.",
        "PAGE_OPTIONS_FEATURES_MajorSubsystemVersion": "Dosyanın ana alt sistem (subsystem) sürüm numarasını belirtir. Alt sistem, dosyanın çalıştırılacağı işletim sistemi alt sisteminin sürümünü belirler.",
        "PAGE_OPTIONS_FEATURES_MinorSubsystemVersion": "Dosyanın yan alt sistem (subsystem) sürüm numarasını belirtir",
        "PAGE_OPTIONS_FEATURES_SizeOfHeaders": "Dosyanın başlık bölümünün ve tüm bölüm başlıklarının (section headers) toplam boyutunu bayt cinsinden belirtir.",
        "PAGE_OPTIONS_FEATURES_CheckSum": "Dosyanın checksum değerini belirtir. Checksum, dosyanın bütünlüğünü doğrulamak için kullanılan bir değerdir. Dosyanın değiştirilip değiştirilmediğini veya zarar gördüğünü kontrol etmek için kullanılır.",
        "PAGE_OPTIONS_FEATURES_SizeOfImage": "Dosyanın bellekteki yüklenme boyutunu belirtir. Yani, dosyanın bellekte kapladığı alanın toplam boyutunu ifade eder.",
        "PAGE_OPTIONS_FEATURES_Subsystem": "Dosyanın çalıştırılacağı işletim sistemi alt sisteminin (subsystem) türünü belirtir. Örneğin, bir dosyanın Windows alt sistemi için bir GUI uygulaması olduğunu belirtmek için 'IMAGE_SUBSYSTEM_WINDOWS_GUI' değeri kullanılır.",
        "PAGE_OPTIONS_FEATURES_DllCharacteristics": "Dinamik bağlantılı kütüphane (DLL) dosyalarının özelliklerini belirtir.",
        "PAGE_OPTIONS_FEATURES_SizeOfStackReserve": "Yığın (stack) belleğinin yürütülebilir dosyanın yüklenme sırasında kullanılan asgari boyutunu belirtir",
        "PAGE_OPTIONS_FEATURES_SizeOfStackCommit": "Yığın (stack) belleğinin yürütülebilir dosyanın çalışma zamanında kullanılacak asgari boyutunu belirtir.",
        "PAGE_OPTIONS_FEATURES_SizeOfHeapReserve": "Yürütülebilir dosyanın çalışma zamanında dinamik bellek tahsisi (heap allocation) için bellekte rezerve edilen toplam boyutu belirtir. Bu alan, programın çalışma zamanında dinamik olarak bellek tahsis etmek için kullanılan bellek miktarını belirler.",
        "PAGE_OPTIONS_FEATURES_SizeOfHeapCommit": "Yürütülebilir dosyanın çalışma zamanında dinamik bellek tahsis (heap allocation) için başlangıçta ayrılan bellek miktarını belirtir. Program çalışırken, dinamik bellek tahsisi gerektiğinde, bu önceden ayrılmış bellek miktarı yığın belleğine (heap) tahsis edilir.",
        "PAGE_OPTIONS_FEATURES_LoaderFlags": "Dosyanın yükleyicisi (loader) tarafından kullanılan bayrakları içerir.",
        "PAGE_OPTIONS_FEATURES_NumberOfRvaAndSizes": "Veri Alanı Dizinleri (Data Directory) dizisinin (veya RVA ve boyutlar dizisinin) öğe sayısını belirtir. Veri Alanı Dizinleri, özellikle İsteğe Bağlı Başlık Bölümü'nde (Optional Header) bulunur ve dosyanın içerdiği çeşitli veri yapılarının yerini ve boyutunu belirler.",
        "PAGE_OPTIONS_FEATURES_DirectoryEntryImport": "Dosyanın içine gömülü olan dışa aktarılan (export edilen) fonksiyonları ve veri yapılarını belirtir.",
        "PAGE_OPTIONS_FEATURES_DirectoryEntryExport": "Dosyanın dışa aktarılan (export edilen) fonksiyonları ve veri yapılarını belirtir.",

        "PAGE_OPTIONS_ABOUT": "Hakkında",
        "PAGE_OPTIONS_ABOUT_TITLE": "Hakkında",
        "PAGE_OPTIONS_ABOUT_EXPANDER_TITLE": "Referanslar ve Linkler",
        "PAGE_OPTIONS_ABOUT_EXPANDER_R1": "- Veri seti linki: Kaggle, [Benign & Malicious PE Files](https://www.kaggle.com/datasets/amauricio/pe-files-malwares/data)",
        "PAGE_OPTIONS_ABOUT_EXPANDER_R2": "- Kaynak kodlar: [Github](https://github.com/thealper2/pescanner)"
    },
    "EN": {
        "PAGE_OPTIONS_HOME": "Home",
        "PAGE_OPTIONS_HOME_TITLE": "pescanner",
        "PAGE_OPTIONS_HOME_PARAGRAPH": "pescanner is a machine learning based malicious file detection tool. It was trained using the [dataset](https://www.kaggle.com/datasets/amauricio/pe-files-malwares/data) on Kaggle. Feature selection was performed using the 'pefile' library. Work steps;",
        "PAGE_OPTIONS_HOME_STEPS_1": "1. **Import Required Libraries:** The models were trained on the 'Kaggle' platform. Necessary libraries are loaded. Auxiliary functions are defined. Library configurations were made.",
        "PAGE_OPTIONS_HOME_STEPS_2": "2. **Analysis:** Blank values and repeated values were checked in the data set. Numerical and categorical columns were identified.",
        "PAGE_OPTIONS_HOME_STEPS_3": "3. **EDA**: Exploratory data analysis was performed.",
        "PAGE_OPTIONS_HOME_STEPS_4": "4. **Feature Scaling:** Unnecessary columns have been dropped. The remaining data consists entirely of numerical values. Standardisation has been done with 'RobustScaler'.",
        "PAGE_OPTIONS_HOME_STEPS_5": "5. **Over Sampling:** Synthetic data were generated to eliminate the irregularity in the data set.",
        "PAGE_OPTIONS_HOME_STEPS_6": "6. **Feature Selection:** Feature selection was performed with the SelectKBest method.",
        "PAGE_OPTIONS_HOME_STEPS_7": "7. **Hyperparameter Tuning:** Hyperparameters were selected with the Optuna tool.",
        "PAGE_OPTIONS_HOME_STEPS_8": "8. **Calibration:** 'Isotonic' and 'Sigmoid' calibration methods were selected as appropriate.",
        "PAGE_OPTIONS_HOME_STEPS_9": "9. **Explanation:** The model is described with the LIME library.",

        "PAGE_OPTIONS_HOME_INSTALLATION_TITLE": "## Installation",
        "PAGE_OPTIONS_HOME_INSTALLATION_PARAGRAPH": "Run the following command to install the necessary libraries.",
        "PAGE_OPTIONS_HOME_USAGE_TITLE": "## Commands",
        "PAGE_OPTIONS_HOME_USAGE_1": "The '--file' parameter is used to scan a single file.",
        "PAGE_OPTIONS_HOME_USAGE_2": "The '--path' parameter is used to scan files in a directory.",
        "PAGE_OPTIONS_HOME_USAGE_3": "If the file is marked as malicious as a result of the scan, the '--remove' parameter is used to automatically delete it.",
        "PAGE_OPTIONS_HOME_USAGE_4": "The '--report' parameter is used to get the results of the scanned files in a CSV format file.",

        "PAGE_OPTIONS_UPLOAD": "Upload",
        "PAGE_OPTIONS_UPLOAD_TITLE": "Sample Results",
        "PAGE_OPTIONS_UPLOAD_HEADER": "Filename:",

        "PAGE_OPTIONS_MODELS": "Models",
        "PAGE_OPTIONS_MODELS_TITLE": "Models",
        "PAGE_OPTIONS_MODELS_HEADER": "Trained models",
        "PAGE_OPTIONS_MODELS_LEGEND_1": "Train accuracy",
        "PAGE_OPTIONS_MODELS_LEGEND_2": "Test accuracy",
        "PAGE_OPTIONS_MODELS_GRAPH_TITLE": "Models",

        "PAGE_OPTIONS_FEATURES": "Features",
        "PAGE_OPTIONS_FEATURES_TITLE": "Features",
        "PAGE_OPTIONS_FEATURES_e_magic": "Creates the first 2 bytes of the PE header. It is used to determine whether the file is a PE file.",
        "PAGE_OPTIONS_FEATURES_e_cblp": "Specifies the length of the executable code when the file is run as a DOS programme.",
        "PAGE_OPTIONS_FEATURES_e_cp": "Specifies the number of relocation entries in the PE file. Relocation entries are used to change the address of the file in memory and are used when the file is loaded at a different memory address.",
        "PAGE_OPTIONS_FEATURES_e_crlc": "Specifies the number of fix-up blocks used in the PE file. Fix-up blocks contain the fixes required to move the executable code of the file to a different address space.",
        "PAGE_OPTIONS_FEATURES_e_cparhdr": "Specifies the number of paragraphs in the header section of the PE file. Paragraphs are blocks of memory 16 bytes long, and this field is used to determine the size of the header section of the file.",
        "PAGE_OPTIONS_FEATURES_e_minalloc": "Specifies the minimum number of blocks of memory that a DOS programme must start with when it is run. That is, the minimum amount of memory required by the file. This value indicates the lower limit of the amount of memory required for the file to run and is used to determine the memory requirements of the DOS programme.",
        "PAGE_OPTIONS_FEATURES_e_maxalloc": "Specifies the maximum number of memory blocks that the DOS program can request when executed. That is, the maximum amount of memory the file can require. This value indicates the upper limit of the amount of memory required for the file to run and is used to determine the memory requirements of the DOS program.",
        "PAGE_OPTIONS_FEATURES_e_ss": "Specifies the stack segment of the executable code of a DOS programme. The stack segment is the area of memory where temporary data used at runtime and local variables used during function calls are stored. This field is used to determine the memory address of the stack segment of the DOS programme.",
        "PAGE_OPTIONS_FEATURES_e_sp": "Specifies the starting address of the stack pointer in the stack segment of the executable code of a DOS programme. The stack pointer keeps track of the operations performed on the stack at runtime and points to the location of the memory region where temporary data is stored.",
        "PAGE_OPTIONS_FEATURES_e_csum": "Specifies whether the sum of the 16-bit word (2 bytes) of all file sections of the DOS program, starting from the start address when the DOS program is run, is equal to mod 65535 (0xFFFF). This is used to check the integrity of the file and is used to determine whether the file is intact for error detection purposes.",
        "PAGE_OPTIONS_FEATURES_e_ip": "Specifies the starting address (instruction pointer) of the executable code of the DOS programme. Upon execution of the executable file, the operating system uses the value of this field to determine where the executable code of the programme starts.",
        "PAGE_OPTIONS_FEATURES_e_cs": "Specifies the code segment of the executable code of the DOS programme. The code segment is the area of memory containing the executable code of the programme. Upon execution of the programme, the operating system uses the value of this field to determine the location of the code segment in memory.",
        "PAGE_OPTIONS_FEATURES_e_lfarlc": "Specifies the offset of the relocation table in the PE file from the beginning of the file, expressed as the long file address. The relocation table contains data used when the file needs to be loaded to a different memory address. This field is used to determine the location of the relocation table within the file.",
        "PAGE_OPTIONS_FEATURES_e_ovno": "Specifies the overlay number to which the executable code of the DOS programme points. An overlay refers to additional pieces of data or code embedded in a file, and this field is used to determine the overlay number the file contains.",
        "PAGE_OPTIONS_FEATURES_e_oemid": "Contains an exclusive equipment manufacturer (OEM) identifier that specifies the hardware platform on which the PE file was created.",
        "PAGE_OPTIONS_FEATURES_e_lfanew": "Specifies the offset of the new executable header section of the file from the beginning of the file, expressed as the long file address. The executable header section contains important information about the structure of the PE file and determines the location of the file's executable code and data segments.",
        "PAGE_OPTIONS_FEATURES_Machine": "PE (Portable Executable) dosyasının yürütülebilir kodunun hedeflediği işlemci mimarisini belirten bir alan veya özelliktir. Bu alan, dosyanın hangi tür işlemcilerde çalışacağını belirlemek için kullanılır. ",
        "PAGE_OPTIONS_FEATURES_NumberOfSections": "Specifies the number of sections contained in the PE file. Sections include code, data, and resource files located in different parts of the file. This field is used to define the structure of the file and determine the size and location of each section in memory.",
        "PAGE_OPTIONS_FEATURES_TimeDateStamp": "It contains a timestamp value representing the time the file was compiled or modified. Usually this value is expressed as a UNIX timestamp in UTC (Coordinated Universal Time) format.",
        "PAGE_OPTIONS_FEATURES_PointerToSymbolTable": "Specifies the starting address of the symbol table in the PE file. The symbol table contains the list of symbols (functions, variables, etc.) in the file and information about these symbols.",
        "PAGE_OPTIONS_FEATURES_NumberOfSymbols": "Specifies the total number of symbols (functions, variables, etc.) in the symbol table in the PE file. The symbol table contains the list of symbols in the file and information about these symbols.",
        "PAGE_OPTIONS_FEATURES_SizeOfOptionalHeader": "Specifies the size of the optional header section of the PE file. The optional header section contains the file's properties and optional data.",
        "PAGE_OPTIONS_FEATURES_Characteristics": "It contains flags that specify the properties and configuration of the PE file. In particular, this field contains flags indicating whether the file is a 32- or 64-bit file, whether it is a DLL file, whether it is a system file, and other properties.",
        "PAGE_OPTIONS_FEATURES_Magic": "Contains a value that specifies the type of the PE file. For example, it can take different values, such as 'MZ' (0x5A4D) for 16-bit DOS applications and 'PE\\0\\0\\0' (0x50 0x45 0x00 0x00) for 32-bit Windows applications.",
        "PAGE_OPTIONS_FEATURES_MajorLinkerVersion": "Indicates the major version number of the file's linker programme. A linker is software that creates an executable file by combining source code and other source files. This field determines which version of the linker created the file.",
        "PAGE_OPTIONS_FEATURES_MinorLinkerVersion": "Specifies the side version number of the linker programme of the file.",
        "PAGE_OPTIONS_FEATURES_SizeOfCode": "Specifies the size of the executable code section of the file in bytes. The executable code section is the segment of code that contains the actual functions of the programme and will be executed in memory.",
        "PAGE_OPTIONS_FEATURES_SizeOfInitializedData": "Specifies the size of the data sections of the file that are initially defined and filled with initial values. These data sections contain the fixed data required for the programme to run.",
        "PAGE_OPTIONS_FEATURES_SizeOfUninitializedData": "Specifies the size of the data sections of the file that are not initially defined but are allocated in memory.",
        "PAGE_OPTIONS_FEATURES_AddressOfEntryPoint": "Specifies the memory address of the entry point of the file. The start point is the memory address where the executable code of the programme starts.",
        "PAGE_OPTIONS_FEATURES_BaseOfCode": "Specifies the starting memory address of the executable code section of the file. The executable code section is the segment of code that contains the actual functions of the programme and will be executed in memory.",
        "PAGE_OPTIONS_FEATURES_ImageBase": "Specifies the starting address of the file in memory. That is, it determines in which address range the file will be located during the loading process in memory.",
        "PAGE_OPTIONS_FEATURES_SectionAlignment": "Determines the alignment of the file's sections in memory. That is, it ensures that the starting address of each section in memory matches the section alignment.",
        "PAGE_OPTIONS_FEATURES_FileAlignment": "Determines the alignment requirement of the file on the disc. It ensures that the starting address of the file on the disk corresponds to this alignment, thus optimising the size and memory usage of the file on the disk.",
        "PAGE_OPTIONS_FEATURES_MajorOperatingSystemVersion": "Specifies the major version number of the operating system from which the file was compiled.",
        "PAGE_OPTIONS_FEATURES_MinorOperatingSystemVersion": "Specifies the minor version number of the operating system from which the file was compiled.",
        "PAGE_OPTIONS_FEATURES_MajorImageVersion": "Specifies the master image version number of the file. This version number identifies the version of the file made available to the user or made available for service.",
        "PAGE_OPTIONS_FEATURES_MinorImageVersion": "Specifies the side image version number of the file.",
        "PAGE_OPTIONS_FEATURES_MajorSubsystemVersion": "Specifies the main subsystem version number of the file. Subsystem specifies the version of the operating system subsystem on which to run the file.",
        "PAGE_OPTIONS_FEATURES_MinorSubsystemVersion": "Specifies the subsystem version number of the file.",
        "PAGE_OPTIONS_FEATURES_SizeOfHeaders": "Specifies the total size, in bytes, of the file's header section and all section headers.",
        "PAGE_OPTIONS_FEATURES_CheckSum": "Specifies the checksum value of the file. Checksum is a value used to verify the integrity of the file. It is used to check whether the file has been modified or damaged.",
        "PAGE_OPTIONS_FEATURES_SizeOfImage": "Specifies the load size of the file in memory. That is, the total size of the space occupied by the file in memory.",
        "PAGE_OPTIONS_FEATURES_Subsystem": "Specifies the type of operating system subsystem on which to run the file. For example, the value 'IMAGE_SUBSYSTEM_WINDOWS_GUI' is used to specify that a file is a GUI application for the Windows subsystem.",
        "PAGE_OPTIONS_FEATURES_DllCharacteristics": "Specifies the properties of dynamically linked library (DLL) files.",
        "PAGE_OPTIONS_FEATURES_SizeOfStackReserve": "Specifies the minimum size of stack memory used during the loading of the executable file.",
        "PAGE_OPTIONS_FEATURES_SizeOfStackCommit": "Specifies the minimum size of stack memory to be used at runtime for the executable.",
        "PAGE_OPTIONS_FEATURES_SizeOfHeapReserve": "Specifies the total size reserved in memory for dynamic memory allocation (heap allocation) at runtime of the executable. This field determines the amount of memory used to dynamically allocate memory at runtime of the programme.",
        "PAGE_OPTIONS_FEATURES_SizeOfHeapCommit": "Specifies the amount of memory initially allocated for dynamic memory allocation (heap allocation) at runtime of the executable. When dynamic memory allocation is required while the programme is running, this preallocated amount of memory is allocated to the heap.",
        "PAGE_OPTIONS_FEATURES_LoaderFlags": "Contains flags used by the loader of the file.",
        "PAGE_OPTIONS_FEATURES_NumberOfRvaAndSizes": "Specifies the number of items in the Data Directory array (or RVA and dimensions array). Data Field Directories are found primarily in the Optional Header and determine the location and size of the various data structures contained in the file.",
        "PAGE_OPTIONS_FEATURES_DirectoryEntryImport": "Specifies the exported functions and data structures embedded in the file.",
        "PAGE_OPTIONS_FEATURES_DirectoryEntryExport": "Specifies the exported functions and data structures of the file.",

        "PAGE_OPTIONS_ABOUT": "About",
        "PAGE_OPTIONS_ABOUT_TITLE": "About",
        "PAGE_OPTIONS_ABOUT_EXPANDER_TITLE": "References",
        "PAGE_OPTIONS_ABOUT_EXPANDER_R1": "- Dataset: Kaggle, [Benign & Malicious PE Files](https://www.kaggle.com/datasets/amauricio/pe-files-malwares/data)",
        "PAGE_OPTIONS_ABOUT_EXPANDER_R2": "- Source Codes: [Github](https://github.com/thealper2/pescanner)"
    }
}